grade = float(input("введите оценку от 1 до 5: "))

if grade == 1:
    print("Очень плохо")
elif grade == 2:
    print("плохо")
elif grade == 3:
    print("нормально")
elif grade == 4:
    print("Хорошо")
elif grade == 5:
    print("Отлично!")
elif grade == 0:
    print("Серьёзно? было же сказано ввести от 1 до 5, читай внимательней в следующий раз.")
elif grade == 6:
    print("Ого! вам настолько понравилось!")
elif grade == 404:
    print("ERROR: 404")
elif grade == 67:
    print("Серьёзно? 😐")